<a href="https://colab.research.google.com/github/NoelPaulMailakkal/SQL-with-Python/blob/main/Untitled2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3
conn = sqlite3.connect('test.db')
print ("Opened database successfully")

Opened database successfully

In [ ]:
conn = sqlite3.connect('NeDB.db')
cursor = conn.cursor()


cursor.execute("DROP TABLE IF EXISTS EMPLOYEE")

X= '''CREATE TABLE IF NOT EXISTS projects (
	id integer PRIMARY KEY,
	name text NOT NULL,
	begin_date text,
	end_date text
); '''
conn.execute(X)
print("Table created")
 
conn.commit()

 
conn.close()

Table created

In [ ]:
import sqlite3

 
X = sqlite3.connect('NeDB.db')
 
Y = X.cursor()

 
Y.execute('''CREATE TABLE Employee(date text, First_Name text, Last_Name text, Age real)''')

 
Y.execute("INSERT INTO Employee VALUES ('2020-01-01','John','Adam',32)")
 
X.commit()

Y.close()

In [ ]:
import sqlite3

 
X = sqlite3.connect('NeDB.db')
Y = X.cursor()
 
#Y.execute('''CREATE TABLE Employee(date text, First_Name text, Last_Name text, Age real)''')

 
Y.execute("INSERT INTO Employee VALUES ('2020-01-01','John','Adam',32),('2020-01-01','Mike','Joseph',30),('2020-01-01','Ann','Maria',32);")

 
X.commit()
Y.close()

In [ ]:
 
import sqlite3
 
conn = sqlite3.connect('NewDB.db')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


print("Data Inserted in the table: ")
data=cursor.execute('''SELECT * FROM STUDENT''')
for row in data:
	print(row)


conn.commit()

conn.close()

Data Inserted in the table:
('John', '8', 'A')
('Adam', '8', 'B')
('Ann', '10', 'A')

In [12]:
 
import sqlite3
 
conn = sqlite3.connect('NewDB.db1')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


cursor.execute("SELECT * FROM STUDENT WHERE CLASS = '10'")

print(cursor.fetchall())
  
conn.commit()
conn.close()


conn.close()

[('Ann', '10', 'A')]

In [14]:
 
import sqlite3
 
conn = sqlite3.connect('NewDB.db2')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


cursor.execute("SELECT * FROM STUDENT WHERE NAME Like'A%'")

print(cursor.fetchall())
  
conn.commit()
conn.close()


conn.close()

[('Adam', '8', 'B'), ('Ann', '10', 'A')]

In [15]:
 
import sqlite3
 
conn = sqlite3.connect('NewDB.db3')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


cursor.execute("SELECT * FROM STUDENT ORDER BY NAME DESC")

print(cursor.fetchall())
  
conn.commit()
conn.close()


conn.close()

[('John', '8', 'A'), ('Ann', '10', 'A'), ('Adam', '8', 'B')]

In [17]:
 
import sqlite3
 
conn = sqlite3.connect('NewDB.db4')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


cursor.execute("SELECT NAME, CLASS FROM STUDENT ORDER BY NAME DESC")

print(cursor.fetchall())
  
conn.commit()
conn.close()


conn.close()

[('John', '8'), ('Ann', '10'), ('Adam', '8')]